Config/Documents/РаспоряжениеОПеречисленииНаКартыМир.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РаспоряжениеОПеречисленииНаКартыМир</Name>
			<BasedOn>
				<xr:Item>Document.РеестрВедомостейНаВыплатуЗарплаты</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БезналичныеДенежныеСредства</xr:Item>
				<xr:Item>AccountingRegister.ЖурналПроводокЕПСБУ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитыЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РеквизитыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Comment>Краткий перечень получателей, включенных в документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникКонтрагент</Name>
					<Comment>0 - перечисление сотрудникам, 1 - контрагентам</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОбязательства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДенежногоОбязательства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганКазначейства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Казначейства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерваяПодпись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВтораяПодпись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеестрВедомостейНаВыплатуЗарплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИзвещения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзвещения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНеподтвержденныхВыплат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПодтвержденныхВыплат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИОисполнителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьИсполнителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонИсполнителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПодписания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Взыскано</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидВыплатНаКартуМИР</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыВыплатНаКартыМИР</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выплачено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодВидаДохода</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КФО</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КВД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КЭК</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлатежнаяКарта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеКартыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазделЛицевогоСчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РазделыЛицевыхСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРожденияДержателяКарты</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПлатежнойКарты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИФО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ошибка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеОшибки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РасшифровкаПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Выплачено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДопКлассификация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДополнительнаяБюджетнаяКлассификация</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодМероприятия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодЦели</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦелевыхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидВыплатНаКартуМИР</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыВыплатНаКартыМИР</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КФО</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КВД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КЭК</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазделЛицевогоСчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РазделыЛицевыхСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИФО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Enums/ТипыЛицевыхСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыЛицевыхСчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Казначейский</Name>
					<Comment>Лицевой счет открыт в органе казначейства или финансовом органе</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Банковский</Name>
					<Comment>Счет открыт в учреждении банка, кредитной организации или на едином казначейском счете</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/РаспоряжениеОПеречисленииНаКартыМир/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	// Логика ограничения:
	// Чтения:     Организация
	// Изменения:  Организация
	
	// Чтение, Изменение: набор №0.
	Строка = Таблица.Добавить();
	Строка.ЗначениеДоступа = Организация;
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	РазницаШапкиИИтогаТЧ = СуммаДокумента - РасшифровкаПлатежа.Итог("Сумма");
	
	Если РазницаШапкиИИтогаТЧ <> 0 Тогда
		ТекстСообщения = НСтр("ru='Сумма документа не равна сумме расшифровки платежа. Не распределена сумма: '") + Формат((РазницаШапкиИИтогаТЧ), "ЧДЦ=2");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, "СуммаДокумента", "Объект",Отказ);
	КонецЕсли;
	
	НеПроверяемыеРеквизиты = Новый Массив;
	
	Если СотрудникКонтрагент = 0 Тогда
		НепроверяемыеРеквизиты.Добавить("Состав.Контрагент");
	Иначе
		НепроверяемыеРеквизиты.Добавить("Состав.Сотрудник");
	КонецЕсли;
	
	Если Не ОбщегоНазначенияБГУПовтИсп.ЗначениеФункциональнойОпции("ИспользоватьУчетПоИФО") Тогда
		НепроверяемыеРеквизиты.Добавить("ИФО");
		НепроверяемыеРеквизиты.Добавить("Состав.ИФО");
	ИначеЕсли ЗначениеЗаполнено(ДокументОснование) Тогда
		НепроверяемыеРеквизиты.Добавить("ИФО");
	Иначе
		НепроверяемыеРеквизиты.Добавить("Состав.ИФО");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Очистка табличной части РасшифровкаПлатежа от строк, не имеющих "родителя" в ТЧ Состав
	// Синхронизация общих реквизитов табличных частей Состав и РасшифровкаПлатежа
	ПоляСостава = Новый Массив;
	Для Каждого РеквизитСостава Из ЭтотОбъект.Метаданные().ТабличныеЧасти.Состав.Реквизиты Цикл
		Если НЕ РеквизитСостава.Имя = "Сумма"
			И НЕ РеквизитСостава.Имя = "ПлатежнаяКарта" 
		//	И НЕ РеквизитСостава.Имя = "ВидВыплатНаКартуМИР"
			И НЕ РеквизитСостава.Имя = "КодВидаДохода"
			И НЕ РеквизитСостава.Имя = "Взыскано" 
			И НЕ РеквизитСостава.Имя = "Ошибка"  
			И НЕ РеквизитСостава.Имя = "ОписаниеОшибки"
			И НЕ РеквизитСостава.Имя = "Сотрудник"
			И НЕ РеквизитСостава.Имя = "НомерПлатежнойКарты"
			И НЕ РеквизитСостава.Имя = "ДатаРожденияДержателяКарты" Тогда

			ПоляСостава.Добавить(РеквизитСостава.Имя);
		КонецЕсли;
	КонецЦикла;
	СписокСвойств = СтрСоединить(ПоляСостава, ", ");
	
	ЛишниеСтроки = Новый Массив;
	Для Каждого СтрокаРасшифровки Из ЭтотОбъект.РасшифровкаПлатежа Цикл
		СтрокаСостава = ЭтотОбъект.Состав.Найти(СтрокаРасшифровки.ИдентификаторСтроки, "ИдентификаторСтроки");
		Если СтрокаСостава = Неопределено Тогда
			ЛишниеСтроки.Добавить(СтрокаРасшифровки);
		Иначе
			ЗаполнитьЗначенияСвойств(СтрокаРасшифровки, СтрокаСостава, СписокСвойств);
		КонецЕсли;
	КонецЦикла;
	Для Каждого ЛишняяСтрока Из ЛишниеСтроки Цикл
		ЭтотОбъект.РасшифровкаПлатежа.Удалить(ЛишняяСтрока);
	КонецЦикла;
	
	Получатели = Новый Массив;
	Для Каждого СтрокаСотрудник Из Состав Цикл
		Получатели.Добавить(Справочники.Контрагенты.ФамилияИО(СтрокаСотрудник.Контрагент));
	КонецЦикла;
	Получатели = ОбщегоНазначенияКлиентСервер.СвернутьМассив(Получатели);
	КраткийСоставДокумента = СтрСоединить(Получатели, ", ");
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПлатежноРасчетныеДокументы.ПриЗаписиНаСервереУстановкаСтатуса(Отказ, ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	GUID = Строка(Новый УникальныйИдентификатор());
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеестрВедомостейНаВыплатуЗарплаты") Тогда
		ЗаполнитьПоРееструВедомостейНаВыплатуЗарплаты(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	GUID = Строка(Новый УникальныйИдентификатор());
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Отказ = ПлатежноРасчетныеДокументы.ВыполнитьДвиженияПлатежноРасчетногоДокумента(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	ПроведениеСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЗаполнениеДокумента

Процедура ЗаполнитьПоРееструВедомостейНаВыплатуЗарплаты(ДанныеЗаполнения)
	
	ДокументОснование = ДанныеЗаполнения.Ссылка;
    Организация = ДанныеЗаполнения.Организация;
	
	Умолчания = Справочники.ЛицевыеСчета.ПолучитьРеквизитыЛицевогоСчетаПоУмолчанию(ДанныеЗаполнения.Организация, "Документ.РаспоряжениеОПеречисленииНаКартыМир", ДанныеЗаполнения.Дата, Перечисления.ТипыЛицевыхСчетов.Казначейский);
	
	Если ЗначениеЗаполнено(Умолчания.ЛицевойСчет) Тогда
		ЛицевойСчет = Умолчания.ЛицевойСчет;
		РеквизитыЛицевогоСчета = Умолчания.РеквизитыЛицевогоСчета;
		ОрганКазначейства = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыЛицевогоСчета, "КассовыйОрган");
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ПлатежноРасчетныеДокументыПовтИсп.ПолучитьСвойстваЛицевогоСчета(ЛицевойСчет,, Новый Структура("ПерваяПодпись,ВтораяПодпись")));
	КонецЕсли;
				
	ДопустимыеКФО = ПлатежноРасчетныеДокументыПовтИсп.ДопустимыеКФО(,ЛицевойСчет);
	СписокДопустимыхКФО = Новый СписокЗначений;
	СписокДопустимыхКФО.ЗагрузитьЗначения(ДопустимыеКФО); 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
	Запрос.Текст = "ВЫБРАТЬ
	               |	РеестрВедомостейНаВыплатуЗарплатыРасшифровкаПлатежа.ИдентификаторСтроки КАК ИдентификаторСтроки,
	               |	РеестрВедомостейНаВыплатуЗарплатыРасшифровкаПлатежа.Контрагент КАК Контрагент,
	               |	РеестрВедомостейНаВыплатуЗарплатыРасшифровкаПлатежа.Сотрудник КАК Сотрудник,
	               |	РеестрВедомостейНаВыплатуЗарплатыРасшифровкаПлатежа.ДопКлассификация КАК ДопКлассификация,
	               |	РеестрВедомостейНаВыплатуЗарплатыРасшифровкаПлатежа.КодМероприятия КАК КодМероприятия,
	               |	РеестрВедомостейНаВыплатуЗарплатыРасшифровкаПлатежа.КодЦели КАК КодЦели,
	               |	РеестрВедомостейНаВыплатуЗарплатыРасшифровкаПлатежа.ВидВыплатНаКартуМИР КАК ВидВыплатНаКартуМИР,
	               |	РеестрВедомостейНаВыплатуЗарплатыРасшифровкаПлатежа.КПС КАК КПС,
	               |	РеестрВедомостейНаВыплатуЗарплатыРасшифровкаПлатежа.КФО КАК КФО,
	               |	РеестрВедомостейНаВыплатуЗарплатыРасшифровкаПлатежа.КЭК КАК КЭК,
	               |	СУММА(РеестрВедомостейНаВыплатуЗарплатыРасшифровкаПлатежа.Сумма) КАК Сумма,
	               |	РеестрВедомостейНаВыплатуЗарплатыРасшифровкаПлатежа.ИФО КАК ИФО,
	               |	РеестрВедомостейНаВыплатуЗарплатыРасшифровкаПлатежа.Подразделение КАК Подразделение,
	               |	РеестрВедомостейНаВыплатуЗарплатыРасшифровкаПлатежа.КодВидаДохода КАК КодВидаДохода,
	               |	1 КАК КоличествоСтрок
	               |ИЗ
	               |	Документ.РеестрВедомостейНаВыплатуЗарплаты.РасшифровкаПлатежа КАК РеестрВедомостейНаВыплатуЗарплатыРасшифровкаПлатежа
	               |ГДЕ
	               |	РеестрВедомостейНаВыплатуЗарплатыРасшифровкаПлатежа.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеестрВедомостейНаВыплатуЗарплатыРасшифровкаПлатежа.ИдентификаторСтроки,
	               |	РеестрВедомостейНаВыплатуЗарплатыРасшифровкаПлатежа.Контрагент,
	               |	РеестрВедомостейНаВыплатуЗарплатыРасшифровкаПлатежа.Сотрудник,
	               |	РеестрВедомостейНаВыплатуЗарплатыРасшифровкаПлатежа.КодМероприятия,
	               |	РеестрВедомостейНаВыплатуЗарплатыРасшифровкаПлатежа.ДопКлассификация,
	               |	РеестрВедомостейНаВыплатуЗарплатыРасшифровкаПлатежа.КодЦели,
	               |	РеестрВедомостейНаВыплатуЗарплатыРасшифровкаПлатежа.ВидВыплатНаКартуМИР,
	               |	РеестрВедомостейНаВыплатуЗарплатыРасшифровкаПлатежа.КПС,
	               |	РеестрВедомостейНаВыплатуЗарплатыРасшифровкаПлатежа.КФО,
	               |	РеестрВедомостейНаВыплатуЗарплатыРасшифровкаПлатежа.КЭК,
	               |	РеестрВедомостейНаВыплатуЗарплатыРасшифровкаПлатежа.ИФО,
	               |	РеестрВедомостейНаВыплатуЗарплатыРасшифровкаПлатежа.Подразделение,
	               |	РеестрВедомостейНаВыплатуЗарплатыРасшифровкаПлатежа.КодВидаДохода
	               |ИТОГИ
	               |	СУММА(КоличествоСтрок)
	               |ПО
	               |	ИдентификаторСтроки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РеестрВедомостейНаВыплатуЗарплатыСостав.Ссылка КАК Ссылка,
	               |	РеестрВедомостейНаВыплатуЗарплатыСостав.НомерСтроки КАК НомерСтроки,
	               |	РеестрВедомостейНаВыплатуЗарплатыСостав.ИдентификаторСтроки КАК ИдентификаторСтроки,
	               |	РеестрВедомостейНаВыплатуЗарплатыСостав.Контрагент КАК Контрагент,
	               |	РеестрВедомостейНаВыплатуЗарплатыСостав.ДатаРожденияДержателяКарты КАК ДатаРожденияДержателяКарты,
	               |	РеестрВедомостейНаВыплатуЗарплатыСостав.НомерПлатежнойКарты КАК НомерПлатежнойКарты,
	               |	РеестрВедомостейНаВыплатуЗарплатыСостав.Сумма КАК Сумма,
	               |	РеестрВедомостейНаВыплатуЗарплатыСостав.Взыскано КАК Взыскано
	               |ИЗ
	               |	Документ.РеестрВедомостейНаВыплатуЗарплаты.Состав КАК РеестрВедомостейНаВыплатуЗарплатыСостав
	               |ГДЕ
	               |	РеестрВедомостейНаВыплатуЗарплатыСостав.Ссылка = &Ссылка";
	
	Результат = Запрос.ВыполнитьПакет();
	
	ВыборкаПоСтроке = Результат[0].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ТЗ_Состав = Результат[1].Выгрузить();
	ТЗ_Состав.Индексы.Добавить("ИдентификаторСтроки");
	
	Состав.Очистить();
	РасшифровкаПлатежа.Очистить();
	
	Пока ВыборкаПоСтроке.Следующий() Цикл
		
		НайденнаяСтрока = ТЗ_Состав.Найти(ВыборкаПоСтроке.ИдентификаторСтроки, "ИдентификаторСтроки");
		
		Если НайденнаяСтрока = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		КоличествоСтрок = ВыборкаПоСтроке.КоличествоСтрок;
		
		Коэффициенты = Новый Массив;
		Для К = 1 По КоличествоСтрок Цикл
			Коэффициенты.Добавить(КоличествоСтрок);
		КонецЦикла;
		
		СуммаВзыскано = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(НайденнаяСтрока.Взыскано, Коэффициенты);
		
		ИндексСтроки = 0;
		
		ВыборкаДетальная = ВыборкаПоСтроке.Выбрать();
		Пока ВыборкаДетальная.Следующий() Цикл
							
			ИдентификаторСтроки = Новый УникальныйИдентификатор();
			
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("ЛицевойСчет", ЛицевойСчет);
			ПараметрыОтбора.Вставить("КФО", ВыборкаДетальная.КФО);
			РазделЛицевогоСчета = ПолучитьРазделЛицевогоСчета(ПараметрыОтбора);
			
			// ТЗ Состав
			НоваяСтрокаСостав = Состав.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаСостав, ВыборкаДетальная);
			НоваяСтрокаСостав.ИдентификаторСтроки = ИдентификаторСтроки;
			НоваяСтрокаСостав.НомерПлатежнойКарты = НайденнаяСтрока.НомерПлатежнойКарты;
			НоваяСтрокаСостав.ДатаРожденияДержателяКарты = НайденнаяСтрока.ДатаРожденияДержателяКарты;
			НоваяСтрокаСостав.РазделЛицевогоСчета = РазделЛицевогоСчета;
			НоваяСтрокаСостав.Взыскано = ?(СуммаВзыскано = Неопределено, "", СуммаВзыскано[ИндексСтроки]);
			
			Если СписокДопустимыхКФО.НайтиПоЗначению(НоваяСтрокаСостав.КФО) = Неопределено Тогда
				НоваяСтрокаСостав.КФО = Перечисления.КВД.ПустаяСсылка();
			КонецЕсли;
			
			// ТЗ Расшифровка платеж
			НоваяСтрокаРП = РасшифровкаПлатежа.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаРП, ВыборкаДетальная);
			НоваяСтрокаРП.ИдентификаторСтроки = ИдентификаторСтроки;
			НоваяСтрокаРП.РазделЛицевогоСчета = РазделЛицевогоСчета;
			
			ИндексСтроки = ИндексСтроки + 1;
			
		КонецЦикла;
		
	КонецЦикла;
	
	СуммаДокумента = РасшифровкаПлатежа.Итог("Сумма");
	
КонецПроцедуры

Функция ПолучитьРазделЛицевогоСчета(ПараметрыОтбора)
	
	РазделЛицевогоСчета = Справочники.РазделыЛицевыхСчетов.ПустаяСсылка();
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	РазделыЛицевыхСчетовДопустимыеКФО.Ссылка
	                      |ИЗ
	                      |	Справочник.РазделыЛицевыхСчетов.ДопустимыеКФО КАК РазделыЛицевыхСчетовДопустимыеКФО
	                      |ГДЕ
	                      |	РазделыЛицевыхСчетовДопустимыеКФО.Ссылка.Владелец = &Владелец
	                      |	И РазделыЛицевыхСчетовДопустимыеКФО.КФО = &КФО");
	
	Запрос.УстановитьПараметр("Владелец", ПараметрыОтбора.ЛицевойСчет);
	Запрос.УстановитьПараметр("КФО", ПараметрыОтбора.КФО);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		РазделЛицевогоСчета = Результат.Ссылка;
	КонецЕсли;
	
	Возврат РазделЛицевогоСчета;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
